# IsPlaceholder Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Duct..::..IsPlaceholder Property
Duct Class See Also
---
Identifies if the duct is a placeholder or not.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsPlaceholder { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsPlaceholder As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsPlaceholder {
	bool get ();
}
```

# See Also
Duct Class
Autodesk.Revit.DB.Mechanical Namespace